app/controllers/comments_controller.rb

SELECT `comments`.* FROM `comments` WHERE `comments`.`id` = 2 LIMIT 1
---
  def find_comment
    @comment = Comment.find_by id: params[:id]